; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l13_p13_c13_g13_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(person-at person1 loc8)
	(person-at person2 loc13)
	(person-at person3 loc12)
	(person-at person4 loc2)
	(person-at person5 loc7)
	(person-at person6 loc4)
	(person-at person7 loc2)
	(person-at person8 loc7)
	(person-at person9 loc6)
	(person-at person10 loc11)
	(person-at person11 loc11)
	(person-at person12 loc12)
	(person-at person13 loc4)
	(person-need person1 medicine)
	(person-need person2 food)
	(person-need person3 medicine)
	(person-need person4 medicine)
	(person-need person5 medicine)
	(person-need person6 medicine)
	(person-need person7 medicine)
	(person-need person8 medicine)
	(person-need person9 medicine)
	(person-need person10 medicine)
	(person-need person11 medicine)
	(person-need person12 medicine)
	(person-need person13 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person8 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person13 medicine)
))
)

; plan
1. (pick-up-crate crate13 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate13 depot)
   added: (has-crate-drone-arm right crate13)
   goals met: 1 of 14
2. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 1 of 14
3. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 0 of 14
4. (drop-crate loc13 person2 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person2 food) (empty-arm left)
   goals met: 1 of 14
5. (drone-move loc13 loc8 drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 loc8)
   goals met: 1 of 14
6. (drop-crate loc8 person1 crate13 right medicine drone1)
   deleted: (has-crate-drone-arm right crate13)
   added: (has-content-person person1 medicine) (empty-arm right)
   goals met: 2 of 14
7. (drone-move loc8 depot drone1)
   deleted: (drone-at drone1 loc8)
   added: (drone-at drone1 depot)
   goals met: 3 of 14
8. (pick-up-crate crate12 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate12 depot)
   added: (has-crate-drone-arm right crate12)
   goals met: 3 of 14
9. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 2 of 14
10. (drop-crate loc6 person9 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm right crate12)
   added: (has-content-person person9 medicine) (empty-arm right)
   goals met: 3 of 14
11. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 4 of 14
12. (pick-up-crate crate11 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate11 depot)
   added: (has-crate-drone-arm right crate11)
   goals met: 4 of 14
13. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 4 of 14
14. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 3 of 14
15. (drop-crate loc12 person3 crate10 left medicine drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person3 medicine) (empty-arm left)
   goals met: 4 of 14
16. (drop-crate loc12 person12 crate11 right medicine drone1)
   deleted: (has-crate-drone-arm right crate11)
   added: (has-content-person person12 medicine) (empty-arm right)
   goals met: 5 of 14
17. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 6 of 14
18. (pick-up-crate crate9 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate9 depot)
   added: (has-crate-drone-arm right crate9)
   goals met: 6 of 14
19. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 6 of 14
20. (drone-move depot loc11 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc11)
   goals met: 5 of 14
21. (drop-crate loc11 person10 crate8 left medicine drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person10 medicine) (empty-arm left)
   goals met: 6 of 14
22. (drop-crate loc11 person11 crate9 right medicine drone1)
   deleted: (has-crate-drone-arm right crate9)
   added: (has-content-person person11 medicine) (empty-arm right)
   goals met: 7 of 14
23. (drone-move loc11 depot drone1)
   deleted: (drone-at drone1 loc11)
   added: (drone-at drone1 depot)
   goals met: 8 of 14
24. (pick-up-crate crate7 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate7 depot)
   added: (has-crate-drone-arm right crate7)
   goals met: 8 of 14
25. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 8 of 14
26. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 7 of 14
27. (drop-crate loc7 person5 crate6 left medicine drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person5 medicine) (empty-arm left)
   goals met: 8 of 14
28. (drop-crate loc7 person8 crate7 right medicine drone1)
   deleted: (has-crate-drone-arm right crate7)
   added: (has-content-person person8 medicine) (empty-arm right)
   goals met: 9 of 14
29. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 10 of 14
30. (pick-up-crate crate5 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate5 depot)
   added: (has-crate-drone-arm right crate5)
   goals met: 10 of 14
31. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 10 of 14
32. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 9 of 14
33. (drop-crate loc4 person6 crate4 left medicine drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person6 medicine) (empty-arm left)
   goals met: 10 of 14
34. (drop-crate loc4 person13 crate5 right medicine drone1)
   deleted: (has-crate-drone-arm right crate5)
   added: (has-content-person person13 medicine) (empty-arm right)
   goals met: 11 of 14
35. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 12 of 14
36. (pick-up-crate crate3 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate3 depot)
   added: (has-crate-drone-arm right crate3)
   goals met: 12 of 14
37. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 12 of 14
38. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 11 of 14
39. (drop-crate loc2 person4 crate2 left medicine drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person4 medicine) (empty-arm left)
   goals met: 12 of 14
40. (drop-crate loc2 person7 crate3 right medicine drone1)
   deleted: (has-crate-drone-arm right crate3)
   added: (has-content-person person7 medicine) (empty-arm right)
   goals met: 13 of 14
41. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 14 of 14
